Use cases of Pandas :-
1. Data cleaning
2. Data Analysis
3. Data Visualization(Basic level).
4. Data aggregation
5. File handling.
6 Data filtering & Selection.
7.Time series Analysis.

Pandas Series :- Aseries is a one dimensional labbeld array capable of holding any data type. the axis labels are collectevly called the index.

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\bittu\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\bittu\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bittu\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bittu\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\bittu\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\bittu\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
## Creting Series 
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
dict = {1:10,2:20,3:30}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(dict)

1    10
2    20
3    30
dtype: int64

When you combine multiple series together called Dataframe.

In [8]:
##Creting a dataframe.
data ={
    'Name':['Bittu','Aditya','Sonu','Sanjeev','Vivek'],
    'Age':[21,19,20,18,20],
    'City':['Afrad','Banglore','Punjab','Bhopal','Siwan'],
    'Salary':[10000,200000,30000,40000,50000]
}
df = pd.DataFrame(data) #crete data frame using DataFrame function.
df

      Name  Age      City  Salary
0    Bittu   21     Afrad   10000
1   Aditya   19  Banglore  200000
2     Sonu   20    Punjab   30000
3  Sanjeev   18    Bhopal   40000
4    Vivek   20     Siwan   50000

In [9]:
data_list =[
    ['Bittu',21,'Afrad',10000],
    ['Aditya',19,'Banglore',20000],
    ['Sonu',19,'Punjab',30000],
    ['Pankaj',23,'Jharkhand',40000],
    ['Sanjeev',18,'Bhopal',50000],
    ['Brajesh',24,'Siwan',60000],
]

df2 = pd.DataFrame(data_list)
columns =['Name','Age','City','Salary']
df2=pd.DataFrame(data_list,columns=columns)
df2

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
1   Aditya   19   Banglore   20000
2     Sonu   19     Punjab   30000
3   Pankaj   23  Jharkhand   40000
4  Sanjeev   18     Bhopal   50000
5  Brajesh   24      Siwan   60000

In [10]:
df2

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
1   Aditya   19   Banglore   20000
2     Sonu   19     Punjab   30000
3   Pankaj   23  Jharkhand   40000
4  Sanjeev   18     Bhopal   50000
5  Brajesh   24      Siwan   60000

In [11]:
df2['Name'] #Accessing a particular column.argmin

0      Bittu
1     Aditya
2       Sonu
3     Pankaj
4    Sanjeev
5    Brajesh
Name: Name, dtype: object

In [12]:
df2[['Name','City']] #Accessing multile columns.

      Name       City
0    Bittu      Afrad
1   Aditya   Banglore
2     Sonu     Punjab
3   Pankaj  Jharkhand
4  Sanjeev     Bhopal
5  Brajesh      Siwan

In [13]:
##Creting a new column
df2['Desigantion']=['Data Analyst','Data Scientist','Web Devlopment','Bank Manager','HR','Doctor']
df2

      Name  Age       City  Salary     Desigantion
0    Bittu   21      Afrad   10000    Data Analyst
1   Aditya   19   Banglore   20000  Data Scientist
2     Sonu   19     Punjab   30000  Web Devlopment
3   Pankaj   23  Jharkhand   40000    Bank Manager
4  Sanjeev   18     Bhopal   50000              HR
5  Brajesh   24      Siwan   60000          Doctor

In [14]:
df2.drop('Desigantion',axis=1,inplace = True) #Dropping a column. inplace = Ture likh ke permanently delete kar sakte ho
df2

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
1   Aditya   19   Banglore   20000
2     Sonu   19     Punjab   30000
3   Pankaj   23  Jharkhand   40000
4  Sanjeev   18     Bhopal   50000
5  Brajesh   24      Siwan   60000

In [15]:
df2

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
1   Aditya   19   Banglore   20000
2     Sonu   19     Punjab   30000
3   Pankaj   23  Jharkhand   40000
4  Sanjeev   18     Bhopal   50000
5  Brajesh   24      Siwan   60000

In [16]:
df2.drop(['City','Salary'],axis=1) #Droppping multiple columns at a time.

      Name  Age
0    Bittu   21
1   Aditya   19
2     Sonu   19
3   Pankaj   23
4  Sanjeev   18
5  Brajesh   24

In [17]:
df2

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
1   Aditya   19   Banglore   20000
2     Sonu   19     Punjab   30000
3   Pankaj   23  Jharkhand   40000
4  Sanjeev   18     Bhopal   50000
5  Brajesh   24      Siwan   60000

In [18]:
df2.loc[0] #Accessing a paricular row by using loc function.

Name      Bittu
Age          21
City      Afrad
Salary    10000
Name: 0, dtype: object

In [20]:
df2.loc[[0,1]] # Accessing a a multiple rows  using loc Function.

     Name  Age      City  Salary
0   Bittu   21     Afrad   10000
1  Aditya   19  Banglore   20000

In [21]:
df2.iloc[3] #Accessing a particular row by using iloc function.

Name         Pankaj
Age              23
City      Jharkhand
Salary        40000
Name: 3, dtype: object

In [ ]:
#Selecting Subset of Rows and Columns
df2.loc[[0,1]][["City","Salary"]] #Accessing multiple rows and multiple columns at a time.

       City  Salary
0     Afrad   10000
1  Banglore   20000

In [23]:
df2.loc[[2,3]][["Name","Age"]] #Accessing multiple rows and multiple columns at a time.

     Name  Age
2    Sonu   19
3  Pankaj   23

In [24]:
#Conditinal selection 
# I only want to see those people whose age is greater than 20.
df2[df2["Age"]>20]

      Name  Age       City  Salary
0    Bittu   21      Afrad   10000
3   Pankaj   23  Jharkhand   40000
5  Brajesh   24      Siwan   60000

In [26]:
# I only want to see those people whose age is greater than 20 and city must be  siwan.
df2[(df2["Age"]>20) & (df2["City"]=='Siwan')]

      Name  Age   City  Salary
5  Brajesh   24  Siwan   60000